app/controllers/api/v1/comentarios_controller.rb

    def show
        @comentario_ = Comentario.find(params[:id])
---
SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 1 LIMIT 1

    def create
        @comentario_ = Comentario.new(parametros_comentarios)
        if @comentario_.save
---
INSERT INTO `comentarios` (`nome`, `comentarioT`, `post_id`, `created_at`, `updated_at`) VALUES ('ola teste', 'ola', 5, '2023-04-04 00:00:00', '2023-04-04 00:00:00')

    def update
        @comentario_ = Comentario.find(params[:id])
---
SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 2 LIMIT 1

    def destroy
        @comentario_ = Comentario.find(params[:id])
        if @comentario_
            @comentario_.destroy
---
SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 2 LIMIT 1
DELETE FROM `comentarios` WHERE `comentarios`.`id` = 2