app/controllers/api/v1/posts_controller.rb

    def create
        @post = Post.new(parametros_)
        if @post.save
---
INSERT INTO `posts` (`id`, `titulo`, `texto`, `user_id`, `created_at`, `updated_at`) VALUES (1, 'facebook commentefefwfwe', 'fewfewefwfdeffwfew', 1, '2023-04-04 00:00:00', '2023-04-04 00:00:00')

    def update
        @post = Post.find(params[:id])
        if @post
            @post.update(parametros_)
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
UPDATE `posts` SET `posts`.`titulo` = 'facebook commentefeEEEfwfwe', `posts`.`updated_at` = '2023-04-04 00:00:00' WHERE `posts`.`id` = 2

    def destroy
        @post = Post.find(params[:id])
        if @post
            @post.destroy
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 1